resume.org
#+title:       Résumé
#+author:      Logan Barnett
#+email:       logustus@gmail.com
#+date:        <2020-01-13 Mon>
#+language:    en
#+file_tags:
#+tags:
#+options:     H:6 num:nil
#+macro:       years-experience (eval (- (nth 5 (decode-time)) 2004))
# #+select_tags: sre leader structure

# Front matter needed by Jekyll.
#+begin_export html
---
layout: default
title: Résumé
date: 2020-01-13
categories: software-engineering
---
#+end_export

# Our CSS specific to the resume.
#+begin_export html
<link rel="stylesheet" type="text/css" href="resume.css" />
#+end_export

* Logan Barnett :noexport:
  old markdown stuff:

---
layout: page
title: Résumé
permalink: /resume/
---

# Logan Barnett #

> Email: [logustus@gmail.com](mailto://logustus@gmail.com)
>
> Mobile: 602.264.3584
>
> Blog: http://loganbarnett.github.io/blog/
>
> Twitter: [@logan_barnett](https://twitter.com/logan_barnett)
>
> Github: https://github.com/loganbarnett



## Job experience ##

### NWEA ###
* Contact :structure:

+ Email: [[mailto://logustus@gmail.com][logustus@gmail.com]]
+ Mobile: 602.264.3584
+ Blog: https://loganbarnett.github.io/blog/
+ Github: https://github.com/loganbarnett

This document was generated from:
https://github.com/LoganBarnett/blog/blob/gh-pages/resume.org
* Summary

I've been a professional software engineer for {{{years-experience}}} years.
I've worked on video games, embedded devices, web applications, desktop
applications, and managed server infrastructure. I prefer a sustainable approach
to software development and maintenance alike. I enjoy providing guidance and
tackling difficult problems. I feel good and functional documentation is the
road to well maintained and understood software.

* Job Experience :structure:
** NWEA (2016-current)
At NWEA I have worked at several teams (typical for the org) and formed many
cross team connections. I was primarily hired for JavaScript and Angular.js
experience but dipped into many other disciplines.
*** DevOps
Joined DevOps team to help with in-house infrastructure applications and tools.
1. Assumed stewardship over all of our in-house applications which controlled
   the colo, managed deployments, managed release planning, and credential
   synchronization. All programs enjoyed improvements over reproducible builds,
   better tests, memoized API calls, and automatic deployments to keep them
   working in a rapidly changing ecosystem.
2. Provided significant direction for Build Engineering sub team to help
   consolidate a wide spread of tech employed. One example is consolidating all
   of our Jenkins build agents into the Cloud Swarm - a flexible pool of
   Dockerized Jenkins agents.
3. Brought perspective to the team who don't have to consume their tools the way
   the engineering teams have to.
*** Assessment
Senior engineer spearheading new proctor interface.
**** Summative Proctor UI
Built a React-Redux user interface for proctoring (running) student tests.
+ Powerful tests :: The UI used algebraic data types with Flow instead of
  ordinary unit tests. Automated tests are Cucumber + Nightwatch.js to pilot a
  browser using tests that relatively untrained QA members could contribute to.
  Achieved 100% type coverage, and 350+ acceptance test scenarios.
+ Automatic Swagger synchronization :: Mocks were kept in sync with the Swagger
  definitions, and all data was sanitized at virtually no cost. The UI
  oftentimes was the insurance that APIs stayed true to their contract.
+ Deployment :: Helped create a Feature flag system allowed features to be
  overridden by QA, to be deployed immediately yet turned on at a predetermined
  time. Closest application to the organization's ongoing CICD efforts.
+ Collaboration :: Worked closely with other teams to ensure smooth cross
  communication between UI and severs. Ongoing org assistance and worked on
  shared projects such as the style guide.
***** JavaScript technologies employed :nodejs:
+ Helped with Webpack setup on the style guide.
+ Setup CSS Modules in the style guide, and educated on their usage.
+ Presented Angular-React demo + PR to show we don't need to write shared
  components for both Angular and React.

*** Item Experience
Senior Engineer providing JavaScript expertise.
**** Build and deployment :sre:
Streamlined a manual build and deploy process.
**** Babel :nodejs:
Implemented Babel transformations for a critical backend Node.js service.
*** OECD
Senior Engineer serving as Angular and Javascript expertise needed by the team.
1. Migrated the administration portion of the project onto Webpack.
2. Created unit testing pattern that is easier to maintain and author.
3. Helped significantly improve the Protractor.js test stability, including
   implementing custom waits for CSS animations, and drawing on screenshots as a
   means of debugging failing tests caused by obscured objects the tests were
   trying to click on.
4. Created script to serve as a first pass at converting all hard-coded strings
   inside of Angular templates into i18n version, and storing the English
   translation with a friendly lookup name.

*** UX/UI organizational needs
Ongoing company assistance and work on shared projects such as the style
guide.
1. Helped with Webpack setup on the style guide.
2. Setup CSS Modules in the style guide, and educated on their usage.
3. Presented Angular-React demo + PR to show we don't need to write shared
   components for both Angular and React (the org uses both in different
   teams).
4. Assisted UX team in making more semantic styling.
5. Acquired and provided accessibility (a11y) expertise.

** IT-Motives -> UTi -> DSV (2014-2016)
*** Client Portal
Senior Engineer leading the UI of Client Portal at UTi and
providing expertise for Angular.JS.
1. Restructured the AngularJS app to take on a larger scale of UI.
2. Implemented caching for values that rarely change.
3. Educated team on quirks of Javascript and AngularJS.
4. Migrated the team to TDD and got the UI up to 100% test coverage.
5. Provided advice for other teams at UTi as they considered taking on.
6. AngularJS as a UI framework.
7. Setup Jenkins for automated CI and test coverage reporting.
8. Setup Cucumber testing to make executable business requirements.
*** Identity Management
Lead engineer on company-wide self-user-management app.
1. React + Redux in a functional style.
2. Highly test driven.
3. Webpack, ES6, Browser-sync, CSSModules.
4. Interfaced heavily with Oracle's security stack.
5. Intended as a pilot project for React for upgrading legacy projects
   piecemeal.

** Arizona State University -> E-Line Media (2011-2014)

