resume.html
---
layout: default
title: Résumé
date: 2020-01-13
categories: software-engineering
---

<link rel="stylesheet" type="text/css" href="resume.css" />

<div id="outline-container-org3f0220a" class="outline-1">
<h1 id="org3f0220a">Contact<span class="tag"><span class="structure">structure</span></span></h1>
<div class="outline-text-1" id="text-org3f0220a">
<ul class="org-ul">
<li>Email: <a href="mailto://logustus@gmail.com">logustus@gmail.com</a></li>
<li>Mobile: 602.264.3584</li>
<li>Blog: <a href="https://loganbarnett.github.io/blog/">https://loganbarnett.github.io/blog/</a></li>
<li>Github: <a href="https://github.com/loganbarnett">https://github.com/loganbarnett</a></li>
</ul>

<p>
This document was generated from:
<a href="https://github.com/LoganBarnett/blog/blob/gh-pages/resume.org">https://github.com/LoganBarnett/blog/blob/gh-pages/resume.org</a>
</p>
</div>
</div>
<div id="outline-container-org74e83a5" class="outline-1">
<h1 id="org74e83a5">Summary</h1>
<div class="outline-text-1" id="text-org74e83a5">
<p>
I&rsquo;ve been a professional software engineer for 17 years.
I&rsquo;ve worked on video games, embedded devices, web applications, desktop
applications, and managed server infrastructure. I prefer a sustainable approach
to software development and maintenance alike. I enjoy providing guidance and
tackling difficult problems. I feel good and functional documentation is the
road to well maintained and understood software.
</p>
</div>
</div>

<div id="outline-container-org2aad985" class="outline-1">
<h1 id="org2aad985">Job Experience<span class="tag"><span class="structure">structure</span></span></h1>
<div class="outline-text-1" id="text-org2aad985">
</div>
<div id="outline-container-org9c767b0" class="outline-2">
<h2 id="org9c767b0">NWEA (2016-current)</h2>
<div class="outline-text-2" id="text-org9c767b0">
<p>
At NWEA I have worked at several teams (typical for the org) and formed many
cross team connections. I was primarily hired for JavaScript and Angular.js
experience but dipped into many other disciplines.
</p>
</div>
<div id="outline-container-orgb8bfda7" class="outline-3">
<h3 id="orgb8bfda7">DevOps</h3>
<div class="outline-text-3" id="text-orgb8bfda7">
<p>
Joined DevOps team to help with in-house infrastructure applications and tools.
</p>
<ol class="org-ol">
<li>Assumed stewardship over all of our in-house applications which controlled
the colo, managed deployments, managed release planning, and credential
synchronization. All programs enjoyed improvements over reproducible builds,
better tests, memoized API calls, and automatic deployments to keep them
working in a rapidly changing ecosystem.</li>
<li>Provided significant direction for Build Engineering sub team to help
consolidate a wide spread of tech employed. One example is consolidating all
of our Jenkins build agents into the Cloud Swarm - a flexible pool of
Dockerized Jenkins agents.</li>
<li>Brought perspective to the team who don&rsquo;t have to consume their tools the way
the engineering teams have to.</li>
</ol>
</div>
</div>
<div id="outline-container-org1b34a65" class="outline-3">
<h3 id="org1b34a65">Assessment</h3>
<div class="outline-text-3" id="text-org1b34a65">
<p>
Senior engineer spearheading new proctor interface.
</p>
</div>
<div id="outline-container-org541685e" class="outline-4">
<h4 id="org541685e">Summative Proctor UI</h4>
<div class="outline-text-4" id="text-org541685e">
<p>
Built a React-Redux user interface for proctoring (running) student tests.
</p>
<dl class="org-dl">
<dt>Powerful tests</dt><dd>The UI used algebraic data types with Flow instead of
ordinary unit tests. Automated tests are Cucumber + Nightwatch.js to pilot a
browser using tests that relatively untrained QA members could contribute to.
Achieved 100% type coverage, and 350+ acceptance test scenarios.</dd>
<dt>Automatic Swagger synchronization</dt><dd>Mocks were kept in sync with the Swagger
definitions, and all data was sanitized at virtually no cost. The UI
oftentimes was the insurance that APIs stayed true to their contract.</dd>
<dt>Deployment</dt><dd>Helped create a Feature flag system allowed features to be
overridden by QA, to be deployed immediately yet turned on at a predetermined
time. Closest application to the organization&rsquo;s ongoing CICD efforts.</dd>
<dt>Collaboration</dt><dd>Worked closely with other teams to ensure smooth cross
communication between UI and severs. Ongoing org assistance and worked on
shared projects such as the style guide.</dd>
</dl>
</div>
<div id="outline-container-org8f16105" class="outline-5">
<h5 id="org8f16105">JavaScript technologies employed<span class="tag"><span class="nodejs">nodejs</span></span></h5>
<div class="outline-text-5" id="text-org8f16105">
<ul class="org-ul">
<li>Helped with Webpack setup on the style guide.</li>
<li>Setup CSS Modules in the style guide, and educated on their usage.</li>
<li>Presented Angular-React demo + PR to show we don&rsquo;t need to write shared
components for both Angular and React.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org33cf2d5" class="outline-3">
<h3 id="org33cf2d5">Item Experience</h3>
<div class="outline-text-3" id="text-org33cf2d5">
<p>
Senior Engineer providing JavaScript expertise.
</p>
</div>
<div id="outline-container-org4a3506f" class="outline-4">
<h4 id="org4a3506f">Build and deployment<span class="tag"><span class="sre">sre</span></span></h4>
<div class="outline-text-4" id="text-org4a3506f">
<p>
Streamlined a manual build and deploy process.
</p>
</div>
</div>
<div id="outline-container-org38c9b9c" class="outline-4">
<h4 id="org38c9b9c">Babel<span class="tag"><span class="nodejs">nodejs</span></span></h4>
<div class="outline-text-4" id="text-org38c9b9c">
<p>
Implemented Babel transformations for a critical backend Node.js service.
</p>
</div>
</div>
</div>
<div id="outline-container-org6240533" class="outline-3">
<h3 id="org6240533">OECD</h3>
<div class="outline-text-3" id="text-org6240533">
<p>
Senior Engineer serving as Angular and Javascript expertise needed by the team.
</p>
<ol class="org-ol">
<li>Migrated the administration portion of the project onto Webpack.</li>
<li>Created unit testing pattern that is easier to maintain and author.</li>
<li>Helped significantly improve the Protractor.js test stability, including
implementing custom waits for CSS animations, and drawing on screenshots as a
means of debugging failing tests caused by obscured objects the tests were
trying to click on.</li>
<li>Created script to serve as a first pass at converting all hard-coded strings
inside of Angular templates into i18n version, and storing the English
translation with a friendly lookup name.</li>
</ol>
</div>
</div>

<div id="outline-container-org3ab561d" class="outline-3">
<h3 id="org3ab561d">UX/UI organizational needs</h3>
<div class="outline-text-3" id="text-org3ab561d">
<p>
Ongoing company assistance and work on shared projects such as the style
guide.
</p>
<ol class="org-ol">
<li>Helped with Webpack setup on the style guide.</li>
<li>Setup CSS Modules in the style guide, and educated on their usage.</li>
<li>Presented Angular-React demo + PR to show we don&rsquo;t need to write shared
components for both Angular and React (the org uses both in different
teams).</li>
<li>Assisted UX team in making more semantic styling.</li>
<li>Acquired and provided accessibility (a11y) expertise.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgbe74377" class="outline-2">
<h2 id="orgbe74377">IT-Motives -&gt; UTi -&gt; DSV (2014-2016)</h2>
<div class="outline-text-2" id="text-orgbe74377">
</div>
<div id="outline-container-orgf6079e9" class="outline-3">
<h3 id="orgf6079e9">Client Portal</h3>
<div class="outline-text-3" id="text-orgf6079e9">
<p>
Senior Engineer leading the UI of Client Portal at UTi and
providing expertise for Angular.JS.
</p>
<ol class="org-ol">
<li>Restructured the AngularJS app to take on a larger scale of UI.</li>
<li>Implemented caching for values that rarely change.</li>
<li>Educated team on quirks of Javascript and AngularJS.</li>
<li>Migrated the team to TDD and got the UI up to 100% test coverage.</li>
<li>Provided advice for other teams at UTi as they considered taking on.</li>
<li>AngularJS as a UI framework.</li>
<li>Setup Jenkins for automated CI and test coverage reporting.</li>
<li>Setup Cucumber testing to make executable business requirements.</li>
</ol>
</div>
</div>
<div id="outline-container-org61f3945" class="outline-3">
<h3 id="org61f3945">Identity Management</h3>
<div class="outline-text-3" id="text-org61f3945">
<p>
Lead engineer on company-wide self-user-management app.
</p>
<ol class="org-ol">
<li>React + Redux in a functional style.</li>
<li>Highly test driven.</li>
<li>Webpack, ES6, Browser-sync, CSSModules.</li>
<li>Interfaced heavily with Oracle&rsquo;s security stack.</li>
<li>Intended as a pilot project for React for upgrading legacy projects
piecemeal.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org576207f" class="outline-2">
<h2 id="org576207f">Arizona State University -&gt; E-Line Media (2011-2014)</h2>
<div class="outline-text-2" id="text-org576207f">
</div>
