resume.org
*** AtlantisRemixed
Co-lead/senior Developer to make a game series to eventually become an MMO.
1. Developed integrated logic system for game designers to code without heavy
   coding knowledge.
2. Designed build system and significant portions of the patching system.
3. Optimized level loading, character composition, and editing tools all built
   in Unity using .net.
4. Integrated game with a Ruby on Rails web stack.
5. Managed small team of software developers.
6. Managed Scrum/Agile process.
7. Continued working remotely with team when I moved to Portland with a good
   deal of success.

*** E-Line Publishing Platform
Software Engineer assisting in construction of an MMO game engine.
1. Continued support of Atlantis Remixed project from ASU partnership.
2. Implemented Action-Condition-System - a server side game logic editing
   system for game designers.
3. Implemented dialog system and later extended it to also be a web authoring
   tool.
4. Implemented distribution system that interfaces with JMS for providing
   realtime communication.
5. Designed and built in-game UI using Angular.JS and fed it data via a
   socket server.

** GoDaddy Inc (2010-2011)
*** Hosted Exchange
Providing Exchange as a hosted/shared solution.
1. Maintenance and enhancements to a Legacy .net app.
2. Extensive work with Powershell to work closely with Exchange 2010.
3. Created support tools using MVC3.

** Integrum Technologies (2009-2010)
Worked as a Rails developer and did extensive pair programming.
*** On the Record Sports
Backend to a fantasy sports app that used SportsDB feed.
1. Consumed complex JSON services
2. Worked very closely with client as main contact remotely using Skype and
   company’s Scrum/Project tracking software
*** 7th Day Adventists
Customizable sites that can display different kinds of content based on
extensions installed.
1. Worked on a legacy Rails app with thousands of users
2. Improved the existing custom deployment scheme
3. Worked with various users on bugs

*** Valley Metro
Public bus schedule system for seeing when/where busses run.
1. Imported data from their system using background processes.
2. Displayed route info using their CSS and layout.
3. =a11y= compliance.

** Happy Camper Studios (2007-2009)
*** Skywire Interface
Manages settings and shows diagnostics for satellite modems.
1. Managed relationship with business's primary contact - Radyne (now Comtech).
2. Desktop application with many forms (20+).
3. Utilized SNMP4J to communicate with modems over the SNMP protocol.
4. Installers written for Windows, Linux, and OSX.
*** Claim Tracker
Manages clients and phone script/history for tracking problems with claims.
1. Managed relationship with business's secondary client - New Haven Dental
2. Built the initial version of the application using Monkeybars.
*** JotBot
Happy Camper Studios' product.
1. Main contribution was against the export feature (CSV, XML, PDF)

** UHaul International (2004-2007)
Entry level software engineering position.
*** Claim Center
Tracked and processed claims (UHaul is self insured).
1. SOAP web services and .net remoting.
2. Bridged Java-based system with existing .net infrastructure
*** Hitch Central
Handles ordering of new hitches and manages hitch inventory.
1. .net desktop client

* Proficiencies :structure:
This is my obligatory buzzword list.
** Languages
*** Javascript
React, Redux, Three, Angular, Node, ES6, Webpack, Flow, npm, yarn.
*** Java
Swing, JAX-RS, JRuby, JUnit, SNMP4J.
*** .net
C#, Boo, Unity/Mono, MVC, WCF, NUnit, OData, Powershell.
*** Ruby
Ruby on Rails, Sinatra, JRuby, Cucumber, RSpec.
*** Rust
Actix, futures, abstract data types, monad chains, and avoiding =unwrap= ;)
** Databases
MongoDB, MySql, SQL Server, Oracle + PL/SQL.
** Misc
Jenkins, JIRA, Pivotal Tracker, Trello, git, Perforce, svn, hg, Plastic SCM,
vim, emacs, literate programming, functional programming.

* Side projects :structure:
1. [[https://github.com/loganbarnett/blog/tree/gh-pages/resume.org][This résumé]] - Uses =org-mode= document and =jekyll= to generate an HTML
   based résumé.
2. [[https://soundcloud.com/lambda-cast][Lambda Cast]] - I costar in a podcast about function functional programming.
3. [[https://github.com/LoganBarnett/dotfiles][My own dotfiles]] - If we value infrastructure as code, why not for our local
   machines? Also contains my Emacs configuration.
4. A few literate programs: [[https://github.com/LoganBarnett/40k-dps][40k-dps]], [[https://github.com/LoganBarnett/airbrush-dias][airbrush-dias]], [[https://github.com/LoganBarnett/typedef-gen][typedef-gen]].
5. [[https://github.com/LoganBarnett/flow-degen][flow-degen]] - Generate typesafe validation/deserialization JavaScript code.
6. [[https://github.com/LoganBarnett/cubed.js][cubed.js]] - A library to help me work on my voxel game.
7. [[https://github.com/LoganBarnett/runner][runner]] - My attempt at making a Rust command line replacement of
   Alfred/Quicksilver.
8. [[https://github.com/LoganBarnett/jj][jj]] - Run Jenkins jobs from the command line and see the output. Rust.
9. roid-miner - A generated asteroid mining game with a powerful editor for
   composing asteroid generators in real time.
10. meta-game - And editor using React + Redux + Three used for creating games
11. Various Unity games - Writing desktop/mobile games using Mono + C# and Boo
    (.net 3.5).
12. Monkeybars - MVC desktop GUI framework using JRuby and Swing.
13. Jemini - 2D game framework for JRuby.
14. Rawr - A packaging system creating double clickable app bundles for JRuby.

* Education :structure:

