resume.html
<div id="outline-container-orgfba465a" class="outline-3">
<h3 id="orgfba465a">AtlantisRemixed</h3>
<div class="outline-text-3" id="text-orgfba465a">
<p>
Co-lead/senior Developer to make a game series to eventually become an MMO.
</p>
<ol class="org-ol">
<li>Developed integrated logic system for game designers to code without heavy
coding knowledge.</li>
<li>Designed build system and significant portions of the patching system.</li>
<li>Optimized level loading, character composition, and editing tools all built
in Unity using .net.</li>
<li>Integrated game with a Ruby on Rails web stack.</li>
<li>Managed small team of software developers.</li>
<li>Managed Scrum/Agile process.</li>
<li>Continued working remotely with team when I moved to Portland with a good
deal of success.</li>
</ol>
</div>
</div>

<div id="outline-container-org9b87324" class="outline-3">
<h3 id="org9b87324">E-Line Publishing Platform</h3>
<div class="outline-text-3" id="text-org9b87324">
<p>
Software Engineer assisting in construction of an MMO game engine.
</p>
<ol class="org-ol">
<li>Continued support of Atlantis Remixed project from ASU partnership.</li>
<li>Implemented Action-Condition-System - a server side game logic editing
system for game designers.</li>
<li>Implemented dialog system and later extended it to also be a web authoring
tool.</li>
<li>Implemented distribution system that interfaces with JMS for providing
realtime communication.</li>
<li>Designed and built in-game UI using Angular.JS and fed it data via a
socket server.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org16140e2" class="outline-2">
<h2 id="org16140e2">GoDaddy Inc (2010-2011)</h2>
<div class="outline-text-2" id="text-org16140e2">
</div>
<div id="outline-container-org0b4ab2c" class="outline-3">
<h3 id="org0b4ab2c">Hosted Exchange</h3>
<div class="outline-text-3" id="text-org0b4ab2c">
<p>
Providing Exchange as a hosted/shared solution.
</p>
<ol class="org-ol">
<li>Maintenance and enhancements to a Legacy .net app.</li>
<li>Extensive work with Powershell to work closely with Exchange 2010.</li>
<li>Created support tools using MVC3.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org5c1fa88" class="outline-2">
<h2 id="org5c1fa88">Integrum Technologies (2009-2010)</h2>
<div class="outline-text-2" id="text-org5c1fa88">
<p>
Worked as a Rails developer and did extensive pair programming.
</p>
</div>
<div id="outline-container-orgca65a5b" class="outline-3">
<h3 id="orgca65a5b">On the Record Sports</h3>
<div class="outline-text-3" id="text-orgca65a5b">
<p>
Backend to a fantasy sports app that used SportsDB feed.
</p>
<ol class="org-ol">
<li>Consumed complex JSON services</li>
<li>Worked very closely with client as main contact remotely using Skype and
company’s Scrum/Project tracking software</li>
</ol>
</div>
</div>
<div id="outline-container-org074a699" class="outline-3">
<h3 id="org074a699">7th Day Adventists</h3>
<div class="outline-text-3" id="text-org074a699">
<p>
Customizable sites that can display different kinds of content based on
extensions installed.
</p>
<ol class="org-ol">
<li>Worked on a legacy Rails app with thousands of users</li>
<li>Improved the existing custom deployment scheme</li>
<li>Worked with various users on bugs</li>
</ol>
</div>
</div>

<div id="outline-container-orgedc3072" class="outline-3">
<h3 id="orgedc3072">Valley Metro</h3>
<div class="outline-text-3" id="text-orgedc3072">
<p>
Public bus schedule system for seeing when/where busses run.
</p>
<ol class="org-ol">
<li>Imported data from their system using background processes.</li>
<li>Displayed route info using their CSS and layout.</li>
<li><code>a11y</code> compliance.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org8e769c5" class="outline-2">
<h2 id="org8e769c5">Happy Camper Studios (2007-2009)</h2>
<div class="outline-text-2" id="text-org8e769c5">
</div>
<div id="outline-container-orgb22def1" class="outline-3">
<h3 id="orgb22def1">Skywire Interface</h3>
<div class="outline-text-3" id="text-orgb22def1">
<p>
Manages settings and shows diagnostics for satellite modems.
</p>
<ol class="org-ol">
<li>Managed relationship with business&rsquo;s primary contact - Radyne (now Comtech).</li>
<li>Desktop application with many forms (20+).</li>
<li>Utilized SNMP4J to communicate with modems over the SNMP protocol.</li>
<li>Installers written for Windows, Linux, and OSX.</li>
</ol>
</div>
</div>
<div id="outline-container-org0f9f9ca" class="outline-3">
<h3 id="org0f9f9ca">Claim Tracker</h3>
<div class="outline-text-3" id="text-org0f9f9ca">
<p>
Manages clients and phone script/history for tracking problems with claims.
</p>
<ol class="org-ol">
<li>Managed relationship with business&rsquo;s secondary client - New Haven Dental</li>
<li>Built the initial version of the application using Monkeybars.</li>
</ol>
</div>
</div>
<div id="outline-container-org8d676c6" class="outline-3">
<h3 id="org8d676c6">JotBot</h3>
<div class="outline-text-3" id="text-org8d676c6">
<p>
Happy Camper Studios&rsquo; product.
</p>
<ol class="org-ol">
<li>Main contribution was against the export feature (CSV, XML, PDF)</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org1216422" class="outline-2">
<h2 id="org1216422">UHaul International (2004-2007)</h2>
<div class="outline-text-2" id="text-org1216422">
<p>
Entry level software engineering position.
</p>
</div>
<div id="outline-container-org6962398" class="outline-3">
<h3 id="org6962398">Claim Center</h3>
<div class="outline-text-3" id="text-org6962398">
<p>
Tracked and processed claims (UHaul is self insured).
</p>
<ol class="org-ol">
<li>SOAP web services and .net remoting.</li>
<li>Bridged Java-based system with existing .net infrastructure</li>
</ol>
</div>
</div>
<div id="outline-container-orge120f0e" class="outline-3">
<h3 id="orge120f0e">Hitch Central</h3>
<div class="outline-text-3" id="text-orge120f0e">
<p>
Handles ordering of new hitches and manages hitch inventory.
</p>
<ol class="org-ol">
<li>.net desktop client</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-orgedd33f9" class="outline-1">
<h1 id="orgedd33f9">Proficiencies<span class="tag"><span class="structure">structure</span></span></h1>
<div class="outline-text-1" id="text-orgedd33f9">
<p>
This is my obligatory buzzword list.
</p>
</div>
<div id="outline-container-org9c2e790" class="outline-2">
<h2 id="org9c2e790">Languages</h2>
<div class="outline-text-2" id="text-org9c2e790">
</div>
<div id="outline-container-orgb257ede" class="outline-3">
<h3 id="orgb257ede">Javascript</h3>
<div class="outline-text-3" id="text-orgb257ede">
<p>
React, Redux, Three, Angular, Node, ES6, Webpack, Flow, npm, yarn.
</p>
</div>
</div>
<div id="outline-container-org1475c82" class="outline-3">
<h3 id="org1475c82">Java</h3>
<div class="outline-text-3" id="text-org1475c82">
<p>
Swing, JAX-RS, JRuby, JUnit, SNMP4J.
</p>
</div>
</div>
<div id="outline-container-org20746d4" class="outline-3">
<h3 id="org20746d4">.net</h3>
<div class="outline-text-3" id="text-org20746d4">
<p>
C#, Boo, Unity/Mono, MVC, WCF, NUnit, OData, Powershell.
</p>
</div>
</div>
<div id="outline-container-orgca364db" class="outline-3">
<h3 id="orgca364db">Ruby</h3>
<div class="outline-text-3" id="text-orgca364db">
<p>
Ruby on Rails, Sinatra, JRuby, Cucumber, RSpec.
</p>
</div>
</div>
<div id="outline-container-org0d2e190" class="outline-3">
<h3 id="org0d2e190">Rust</h3>
<div class="outline-text-3" id="text-org0d2e190">
<p>
Actix, futures, abstract data types, monad chains, and avoiding <code>unwrap</code> ;)
</p>
</div>
</div>
</div>
<div id="outline-container-org8e91a77" class="outline-2">
<h2 id="org8e91a77">Databases</h2>
<div class="outline-text-2" id="text-org8e91a77">
<p>
MongoDB, MySql, SQL Server, Oracle + PL/SQL.
</p>
</div>
</div>
<div id="outline-container-orge9bba20" class="outline-2">
<h2 id="orge9bba20">Misc</h2>
<div class="outline-text-2" id="text-orge9bba20">
<p>
Jenkins, JIRA, Pivotal Tracker, Trello, git, Perforce, svn, hg, Plastic SCM,
vim, emacs, literate programming, functional programming.
</p>
</div>
</div>
</div>

<div id="outline-container-org9ed5f8c" class="outline-1">
<h1 id="org9ed5f8c">Side projects<span class="tag"><span class="structure">structure</span></span></h1>
<div class="outline-text-1" id="text-org9ed5f8c">
<ol class="org-ol">
<li><a href="https://github.com/loganbarnett/blog/tree/gh-pages/resume.org">This résumé</a> - Uses <code>org-mode</code> document and <code>jekyll</code> to generate an HTML
based résumé.</li>
<li><a href="https://soundcloud.com/lambda-cast">Lambda Cast</a> - I costar in a podcast about function functional programming.</li>
<li><a href="https://github.com/LoganBarnett/dotfiles">My own dotfiles</a> - If we value infrastructure as code, why not for our local
machines? Also contains my Emacs configuration.</li>
<li>A few literate programs: <a href="https://github.com/LoganBarnett/40k-dps">40k-dps</a>, <a href="https://github.com/LoganBarnett/airbrush-dias">airbrush-dias</a>, <a href="https://github.com/LoganBarnett/typedef-gen">typedef-gen</a>.</li>
<li><a href="https://github.com/LoganBarnett/flow-degen">flow-degen</a> - Generate typesafe validation/deserialization JavaScript code.</li>
<li><a href="https://github.com/LoganBarnett/cubed.js">cubed.js</a> - A library to help me work on my voxel game.</li>
<li><a href="https://github.com/LoganBarnett/runner">runner</a> - My attempt at making a Rust command line replacement of
Alfred/Quicksilver.</li>
<li><a href="https://github.com/LoganBarnett/jj">jj</a> - Run Jenkins jobs from the command line and see the output. Rust.</li>
<li>roid-miner - A generated asteroid mining game with a powerful editor for
composing asteroid generators in real time.</li>
<li>meta-game - And editor using React + Redux + Three used for creating games</li>
<li>Various Unity games - Writing desktop/mobile games using Mono + C# and Boo
(.net 3.5).</li>
<li>Monkeybars - MVC desktop GUI framework using JRuby and Swing.</li>
<li>Jemini - 2D game framework for JRuby.</li>
<li>Rawr - A packaging system creating double clickable app bundles for JRuby.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb165304" class="outline-1">
<h1 id="orgb165304">Education<span class="tag"><span class="structure">structure</span></span></h1>
<div class="outline-text-1" id="text-orgb165304">
</div>
