resume.org
** DeVry University

Graduated 2004 with BS in Computer Engineering Technology

* COMMENT views

I wind up doing a lot of things at the places I work, and I can't possibly
include every tiny accomplishment (nor every major accomplishment) at every
place that I work. I feel it's a good idea to show _how_ I have been well suited
for the role I am applying for.

This document is setup to express certain views of my career history. By
coloring my data in certain ways, I can render a resume that reflects a variety
of things without me having to keep all of those resumes up to date.

** using headlines and tags to produce views

A headline with tags makes the most sense to me in terms of things to show or
not show. This doesn't always translate well when exporting to markdown, but I
think I can make this work by setting the heading to some fixed amount. To do so
I must assume a structure. I think the relative structure of workplace ->
project -> accomplishment will do just fine there. Each of those three entities
will be an =org-mode= heading. Hopefully in the export, it will be rendered as a
list once it gets to accomplishments.

Then what I do is I add a tag to each accomplishment. I then indicate that only
certain tags are visible during the export.

What this approach misses is that I don't get to use a sentence. Perhaps with
some CSS I could remove the line break from the heading and the entry, and make
it look like a label with a description.



* COMMENT settings
This heading must go on the bottom. It is implicitly not exported, and settings
can be set here.

Local Variables:
org-html-toplevel-hlevel:1
End:
