resume.html
<div id="outline-container-org8a1b33e" class="outline-2">
<h2 id="org8a1b33e">DeVry University</h2>
<div class="outline-text-2" id="text-org8a1b33e">
<p>
Graduated 2004 with BS in Computer Engineering Technology
</p>
</div>
</div>
</div>
